        IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           FUNCTION ALL INTRINSIC.
       INPUT-OUTPUT SECTION.

       FILE-CONTROL.

       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.

       01  WS-RECORD.
           05  WS-RECORD-VAL              PIC X(150).

       PROCEDURE DIVISION.

       0000-MAINLINE.
           DISPLAY "HELLO".

       0000-MAINLINE-EXIT. EXIT.
       STOP RUN.
